[
  {
    "id": "sales-and-marketing-intern",
    "position": "Sales & Marketing Intern",
    "summary": "Would you like an internship with full of opportunities? As a Sales and Marketing  intern you will focus on our (business) sales, digital marketing, social media and so much more.",
    "location": "Stockholm, Sweden",
    "aboutPosition": [
      "AxCrypt is looking for a talented Sales and Marketing intern, to help us improve our digital marketing, sales and social media with a focus on growth.",
      "Since most of our users are located in English speaking countries, your skills in language are very important. Fluency in spoken and written English is a must. If you speak an additional language (Eg. French, Spanish and/or German), it is a huge plus.",
      "The day-to-day activities include the management of our social media channels, business customer support and administration (through email and CRM), content creation for newsletters, blog posts and social media. You will also work with Google tools, such as Analytics and Ads. Knowledge of this is not necessary, but of course we expect you to be willing to learn! This also applies to our web development in WordPress. We would also like for you to work on larger projects, such as a sales strategy for a specific region.",
      "If you are in a business related field of studies, and interested in gaining experience, this creative and powerful start-up is the right place for you. Our internships last 4-8 months. Selection is ongoing throughout the year, so don’t hesitate to apply.",
      "You can find the key responsibilities and skills & experience related to this position below.",
      "To apply, click the button below or send your resume with personal letter to apply@axcrypt.net.",
      "P.S. Don’t skip the personal letter, we’d love to hear more about you and why we should have you on our team!"
    ],
    "keyResponsibilities": [
      "Shaping our brand identity through social media",
      "Managing and developing our growing community of users",
      "Organizing great events",
      "Involved in advertising, business inquiries, and CRM",
      "Assisting with the business and economics side",
      "Write content for newsletters and blog posts"
    ],
    "skillsAndExperience": [
      "Fluent in both spoken and written English",
      "Knowledge of additional languages is a plus",
      "Experience in WordPress is appreciated but not a must",
      "Studying in a business related field at university/college level",
      "Familiar with social media platforms and strategies",
      "Content creation talent is a plus",
      "Willing to learn and ability to take initiative"
    ]
  }
]